//
//  CreaterFormViewModel.swift
//  Myanmar Song Book
//
//  Created by Aung Ko Min on 27/4/22.
//

import Foundation
import Combine

final class CreaterViewModel: ObservableObject {
    
    weak var textView: CreaterTextView?

    @Published var song = Song()
    @Published var showForm = false
    
    init() {
        setupSubscriptions()
    }
    
    func validate() {
        showForm = song.hasNotFilledForm
    }
    
    private var subscriptions = Set<AnyCancellable>()
    private func setupSubscriptions() {
        $song
            .debounce(for: .seconds(1), scheduler: DispatchQueue.main)
            .compactMap{$0}
            .sink { [weak self] song in
                self?.textView?.set(string: song.rawText)
            }
            .store(in: &subscriptions)
    }
}

extension Song {
    
    var hasNotFilledForm: Bool { title.isWhitespace || artist.isWhitespace }
    var canSave: Bool { !hasNotFilledForm && !rawText.isWhitespace }
    
    static let aLoMaShi: Song = {
        var x = Song(rawText: FormatIdentifier.process(aloMaShi))
        x.title = "အလိုမရှိ"
        x.artist = "Myanmar Gen Z"
        x.composer = "Myanmar Gen Z"
        x.key = "A"
        x.album = "Spring Revolution"
        x.genre = "other"
        return x
    }()
    static let kabarMaKyay: Song = {
        var x = Song(rawText: kabarMaKyayString)
        x.title = "ကမ္ဘာမကျေ"
        x.artist = "တို့ဘိုးဘွား"
        return x
    }()
    static let minSateNetKoeKo: Song = {
        var x = Song(rawText: minSateNetKoeKoString)
        x.title = "မင်းစိတ်နဲ့ကိုယ့်ကိုယ်"
        x.artist = "Alex"
        x.album = "အဲလက်စ်နှင့်သူ၏သီချင်းများ"
        x.composer = "ကိုနေဝင်း"
        x.key = "A"
        return x
    }()
}

let minSateNetKoeKoString = """
{title: မင်းစိတ်နဲ့ကိုယ့်ကိုယ်}
{subtitle: Alex}
{composer : ကိုနေဝင်း}
{album: အဲလက်စ်နှင့်သူ၏သီချင်းများ}
{key: A}

[G]တိမ်လို တွယ်ရာမဲ့စွာ[D]နဲ့ [Em]လေနှင်ရာကို လွှင့်ပစ်[C]ခဲ့
အချစ်[G]လေး မင်းမရှိတော့လည်း[D]
ကိုယ့်တစ်ယောက်[G]တည်း[D][C]
"""
let kabarMaKyayString = """
{title: ကမ္ဘာမကျေ မြန်မာပြည်}
{artist: များလူခပ်သိမ်း}
{key: C}

[C] [Am] [F] [G]
[C]တရားမျှတ [Am]လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ [F]တို့မြေ၊[G]
[C]များလူခပ်သိမ်း၊ [Am]ငြိမ်းချမ်းစေဖို့၊[G]
ခွင့်တူညီမျှ၊ [F]ဝါဒဖြူစင်တဲ့ပြည်၊[F][G]
တို့ပြည်၊ [C]တို့မြေ၊
ပြည်[Am]ထောင်စုအမွေ၊ [G]အမြဲတည်တံ့စေ၊[F][Am]
[C]အဓိဋ္ဌာန်ပြုပေ၊ [G]ထိန်း[F]သိမ်းစို့လေ[Am]

ကမ္ဘာမကျေ၊[G] မြန်မာပြည်၊[Am][C][G]
[Am]တို့ဘိုးဘွား [C]အမွေစစ်မို့ [G]ချစ်မြတ်နိုးပေ။
ပြည်ထောင်စုကို [Dm]အသက်ပေးလို့ [Am]တို့ကာကွယ်မလေ၊[C][F][G]
ဒါတို့ပြည် [An]ဒါတို့မြေ [C]တို့ပိုင်နက်မြေ။[F]
[C]တို့ပြည် တို့မြေ [F]အကျိုးကို [G]ညီညာစွာတို့တစ်တွေ[Am]
[F]ထမ်းဆောင်ပါစို့လေ [G]တို့တာဝန်ပေ အဖိုးတန်မြေ။[C]

[C][Am][F][G]
[C]တရားမျှတ [Am]လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ [F]တို့မြေ၊[G]
[C]များလူခပ်သိမ်း၊ [Am]ငြိမ်းချမ်းစေဖို့၊[G]
ခွင့်တူညီမျှ၊ [F]ဝါဒဖြူစင်တဲ့ပြည်၊[F][G]
တို့ပြည်၊ [C]တို့မြေ၊
ပြည်[Am]ထောင်စုအမွေ၊ [G]အမြဲတည်တံ့စေ၊[F][Am]
[C]အဓိဋ္ဌာန်ပြုပေ၊ [G]ထိန်း[F]သိမ်းစို့လေ[Am]

ကမ္ဘာမကျေ၊[G] မြန်မာပြည်၊[Am][C][G]
[Am]တို့ဘိုးဘွား [C]အမွေစစ်မို့ [G]ချစ်မြတ်နိုးပေ။
ပြည်ထောင်စုကို [Dm]အသက်ပေးလို့ [Am]တို့ကာကွယ်မလေ၊[C][F][G]
ဒါတို့ပြည် [An]ဒါတို့မြေ [C]တို့ပိုင်နက်မြေ။[F]
[C]တို့ပြည် တို့မြေ [F]အကျိုးကို [G]ညီညာစွာတို့တစ်တွေ[Am]
[F]ထမ်းဆောင်ပါစို့လေ [G]တို့တာဝန်ပေ အဖိုးတန်မြေ။[C]
"""
let hotelCaliforniaString = """
Em                   Am      D                 Em
မနက်အစောကြီးထလို့ ပန်းတွေကောက်   စျေးဗန်းလေးနဲ့ လမ်းပေါ်လျှောက်
Em               Am     C         B7           Em
အမေ့ဆေးခန်းပြဖို့ ပိုက်ဆံစုရမယ်   ပန်းရောင်း ကောင်းဖို့အတွက် ဆုတောင်း
 
Em                       Am  D                        Em
ကောက်ညှင်းပေါင်းစားပြီး စျေးတွေရောင်း အဖေ့အားဆေးလေးများ စျေးတွေကောင်း
Em                       Am     C        B7             Em
အဖေကြိုက်တဲ့ ကြေးအိုးလေး ၀ယ်ကျွေးဖို့ကွယ် ပန်းရောင်း ကောင်းဖို့အတွက် ဆုတောင်း
 

    Am               Em          Gbdim7         B7      Em
ကမ္ဘာကြီးထဲမှာ အရာရာတိုင်း တိုးတက်ကြပါစေ ဒီမီးပွိုင့် အဟောင်းကြီးတော့ ခဏကျန်စေချင်ပါတယ်
    Am             Em        Gbdim7              B7
အဖေ နဲ့ အမေ့လိုအင်ဆန္ဒ ဖြည့်ရတဲ့အချိန် အမှန်တွေကို ခဏမျိုသိမ့်ထားတယ်…
 

Em            Am    D                   G  B7
မီးပွိုင့်ကြီးရေ နီလိုက်ဦး     အခုထိစျေးဦး  မပေါက်သေးလို့
Em             Am                     C      B7         Em
မီးပွိုင့်ပျက်ရင်ပိုပြီး  ရောင်းကောင်းလွန်းတယ် ကျွန်တော်ဟာ အတ္တကြီးတဲ့ ပန်းသည်ဗျို့..
Em                     Am      D                G  B7
မီးပွိုင့်ကြီးဟာ ကျွန်တော့ အသည်းနှလုံး    ကားများပိတ်ရင် ပျော်လို့မဆုံး
 Em          Am                  C             B7         Em
မီးစိမ်းပြချိန် ခဏပဲသတ်မှတ်ပေးကွယ် ကျွန်တော်ဟာ တစ်ဖက်တည်းကြည့်တဲ့ ပန်းသည်ဗျို့
 
 
Em                        Am      D               Em
ကျောင်းသွားတော့မယ့် ကျွန်တော့ ညီတစ်ယောက် မုန့်ဟင်းခါးစားဖို့ ၃၀၀ လောက်တဲ့
Em                   Am        C    B7         Em
စာများများတတ်ဖို့ ကျောင်းကို သွားတော့ကွယ် မင်းကငါ့ထက် အဖိုးတန်တယ်
 
 
    Am              Em          Gbdim7           B7     Em
ကမ္ဘာကြီးထဲမှာ အရာရာတိုင်း တိုးတက်ကြပါစေ ဒီမီးပွိုင့် အဟောင်းကြီးတော့ ခဏကျန်စေချင်ပါတယ်
    Am             Em         Gbdim7              B7
အဖေ နဲ့ အမေ့လိုအင်ဆန္ဒ ဖြည့်ရတဲ့အချိန် အမှန်တွေကို ခဏမျိုသိမ့်ထားတယ်…
 
 
Em            Am    D                   G  B7
မီးပွိုင့်ကြီးရေ နီလိုက်ဦး     အခုထိစျေးဦး  မပေါက်သေးလို့
Em             Am                     C      B7        Em
မီးပွိုင့်ပျက်ရင်ပိုပြီး  ရောင်းကောင်းလွန်းတယ် ကျွန်တော်ဟာ အတ္တကြီးတဲ့ ပန်းသည်ဗျို့..
 Em                   Am       D                G B7
မီးပွိုင့်ကြီးဟာ ကျွန်တော့ အသည်းနှလုံး    ကားများပိတ်ရင် ပျော်လို့မဆုံး
Em            Am                  C            B7         Em
မီးစိမ်းပြချိန် ခဏပဲသတ်မှတ်ပေးကွယ် ကျွန်တော်ဟာ တစ်ဖက်တည်းကြည့်တဲ့ ပန်းသည်ဗျို့
 
 
       C      B7         Em
ကျွန်တော်ဟာ အတ္တကြီးတဲ့ ပန်းသည် ဗျို့

"""

let aloMaShi = """
# Intro
[A] [Gbm] [D] [E] [A] [Gbm] [E]

# Verse 1
[A]တစ်ယောက်တည်း ခံစားနေရ အမေ့သားတွေ သမီးတွေ [Gbm]လက်တွေပြ
[D]ပုခုံးပေါ်ထမ်းတင်ထားတဲ့ အမေ့စကားတွေ နားထဲ[E]ကြားနေရ
[A]ဘယ်လိုပဲ အခက်အခဲတွေရှိပါစေ အကုန်ဖြတ်ကျော်သွားမယ့် [Gbm]စိတ်ကိုထား
[D]တစ်ယောက်ချင်းအကုန်ဝိုင်းတွန်းကြရင် ပိတ်ထားတဲ့ တံခါး[E]များပွင့်မှာပါ
[D]သစ်တစ်ပင်ကောင်းမှ [E]ငှက်တစ်သောင်းနားလို့ရ[A]မှာပါ

# Verse 2
[A]အမှန်တရားကို ရရင်ရ ပြန်မရရင် အဆုံးထိသွား[Gbm]မှာပါ
[D]သံပုံးတွေရှေ့မှာချ တစ္ဆေတစ်ယောက်လို မောင်းထုတ်သွား[E]မှာပါ
[A]အနိုင်ရရင် ကချင်ကမယ် အနိုင်မရရင်သွေးတွေ [Gbm]ရဲနေမှ
[D]ပိတ်ထားတဲ့နားတွေက [E]အကုန်လုံးအော်ပြောမှ ကြား[A]မှာပါ

# Chorus
[A]အာဏာရှင်မောင်းထုတ်ကြမယ် အလိုမရှိ အလိုမရှိ
ပြည်သူတွေ ကန့်ကွက်ကြမယ် [Gbm]အလိုမရှိ အလိုမရှိ
[D]သံပုံးတွေ တို့အတူတီး အမှန်တရားအတွက် ရဲရင့်[E]ဖို့လိုပြီ
[A]အာဏာရှင်မောင်းထုတ်ကြမယ် အလိုမရှိ အလိုမရှိ
ပြည်သူတွေ ကန့်ကွက်ကြမယ် [Gbm]အလိုမရှိ အလိုမရှိ
သံပုံးတွေ တို့အတူတီး အမှန်တရားအတွက် ရဲရင့်[E]ဖို့လိုပြီ
[D]ဆန္ဒဖော်ထုတ်ကြမယ် [E]အမှန်တရားဘက်မှာ ငါတို့ ရပ်တည်[A]ပြီ/မည်
[A] [Gbm] [D] [E] [A] [Gbm] [D] [E]
ဟေ့ ဟေ့ ဟေ့ ဟေ့ ဟေ့ ဟေ့ ဟေ့ ဟေ့

# Verse 2

# Chorus

[D]ဆန္ဒဖော်ထုတ်ကြမယ် [E]အမှန်တရားဘက်မှာ ငါတို့ ရပ်တည်[A]ပြီ/မည်
[A]ဒီမိုကရေစီ ရရှိရေး ဒို့အရေး ဒို့အရေး ဒီမိုကရေစီ ရရှိရေး ဒို့အရေး ဒို့အရေး
[A]သပိတ် သပိတ် မှောက်မှောက် သပိတ် သပိတ် မှောက်မှောက်
[A]ရုံးမတက်နဲ့ ရုံးထွက် ရုံးမတက်နဲ့ ရုံးထွက်
[A]အရေးတော်ပုံ အောင်ရမည် အရေးတော်ပုံ အောင်ရမည် အရေးတော်ပုံ အောင်ရမည် ... Fade
"""
